Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.GetRevitElementIds
return the list of revit Element Ids

Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.GetParentHwnd
return the parent handle

Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.Document
return the document

Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.IsReset
flag to indicate the value has been reset

Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.ParamId
the parameter id

Autodesk.Revit.UI.RevisionsOnSheetUIServiceData
UI data wrapper for RevisionsOnSheetUIService.